[
    {
        "number": 1,
        "question": "Why must you put your money into investments?",
        "ans": "A savings fund is built up by setting aside money from each paycheck. Savings in a bank account, however, will eventually generate little or no interest. This is due to the savings account's failure to provide returns that outpace inflation. Thus, there will be a decline in purchasing power. Additionally, simply saving money could result in a financial loss over time. Investors can make their money work for them by investing. Investing to generate future revenue is the main goal of investing. Additionally, investments might help with emergency situations and unforeseen costs. Here are some justifications for investing money."
    },
    {
        "number": 2,
        "question": "How Does Investing Work?",
        "ans": "Investing is the process of buying something now in order to profit from it later. Investors put money into an investment with the goal of making money, either through long-term capital growth or ongoing income from the investment. Investments can be made in stocks, bonds, real estate, or equipment used in manufacturing. It also entails spending money on education, which will help acquire knowledge and enhance the skills necessary for earning money in the future."
    },
    {
        "number": 3,
        "question": "Why choose us for investment?",
        "ans": "There are risks hidden within the financial plan. As a financial advisor, we will let you be aware of the hidden charges while investing your capital."
    },
    {
        "number": 4,
        "question": "Why Choose Us for Loans ?",
        "ans": "IAs a financial professional, we suggest you do it the proper way for loan processing. Most of the time, borrowers face rejection in the initial stages.It is true that the majority of loan applications fail the first hurdle! They are rejected based on criteria such as age, income, insufficient bank validations, or even verifiable evidence that does not satisfy the lender's requirements. To a certain limited extent, this can be avoided by carefully reading the eligibility requirements of lending banks and following them precisely in a series of steps."
    }
]