[
    {
       "darkorligh": "#303841",
          "lightdark":"rgba(159, 201, 221, 0.3)",
       "color":"#303841",
        "para": "With Instant Developers, Cutting-Edge Technology, a Skilled Team, Cost-Effective/Economy, Confidentiality, and Time Zone Flexibility, we have delivered software services to multiple domain companies"
    },
    {
        "darkorligh": "#fff",
        "lightdark":"#303841",
        "color":"#fff",
        "para": "Bigtime is dedicated to engineering optimal technological solutions that increase global earnings for international clients."
    },
    {
        "darkorligh": "#303841",
           "lightdark":"rgba(159, 201, 221, 0.3)",
        "color":"#303841",
        "para": "We are well-versed in the industry's most recent technology and trends. This ensures that we finish your project utilizing the most recent techniques and that your developers are up-to-date on the most exciting developments."
    },
    {
        "darkorligh": "#fff",
        "lightdark":"#303841",
        "color":"#fff",
        "para": "Our organization is well-equipped with cutting-edge technology and tools. We strive for disciplined and well-organized systems development. Performance, delivery, and winning customers—that's how we've functioned for years and will continue to operate in the future."
    },
    {
        "darkorligh": "#303841",
           "lightdark":"rgba(159, 201, 221, 0.3)",
        "color":"#303841",
        "para": "We have a dedicated staff of incredibly motivated, dynamic, and innovative engineers who can be immediately deployed to assist in driving things forward in your product roadmap or quickly iterate on new product ideas so you can focus on the critical areas of the business."
    },
    {
        "darkorligh": "#fff",
        "lightdark":"#303841",
        "color":"#fff",
        "para": "We have a robust team of experienced software programmers in various technological sets ranging from mobility, web development, Blockchain, AI, and more. "
    }
]